clear
clc
% -------------------------------规定固定参数---------------------------
% 定义移动平台的尺寸和重量，长度用LEN原因：L为机械臂连杆参数，重叠，故用LEN
syms LEN W H M;
% 规定移动平台重心位置
pm=sym('[pm1; pm2; pm3]','real');
% 机械臂质量向量,建议计算时以具体数值代入
m=sym('[m1; m2; m3; m4; m5; m6]','real');
% D-H参数向量，建议计算时以实际数值代入
d=sym('[d1; d2; d3; d4; d5; d6]','real');
a=sym('[a1; a2; a3; a4; a5; a6]','real');
alpha=sym('[alpha1; alpha2; alpha3; alpha4; alpha5; alpha6]','real');
% 规定机械臂在移动平台上的安装位置
pb=[0.5*LEN; 0.5*W; H];
% 规定坐标系i的原点到质心Ci的向量,这里的c1至c6很有可能为负值，其中c5为0
rc=sym('[0, c2, 0, 0, 0, 0 ; c1, 0, 0, c4, 0, 0 ; 0, 0, c3, 0, 0, c6]');
% 建立IRB120的D-H参数矩阵
L(1)=Link('d',d(1),'a',a(1),'alpha',alpha(1));
L(2)=Link('d',d(2),'a',a(2),'alpha',alpha(2));
L(3)=Link('d',d(3),'a',a(3),'alpha',alpha(3));
L(4)=Link('d',d(4),'a',a(4),'alpha',alpha(4));
L(5)=Link('d',d(5),'a',a(5),'alpha',alpha(5));
L(6)=Link('d',d(6),'a',a(6),'alpha',alpha(6));
% 建立机器人
IRB120=SerialLink(L,'name','IRB120');
% -------------------------------规定固定参数完---------------------------


% -------------------------------规定初始输入参数---------------------------
%规定机械臂各关节的角度
q=sym('[q1; q2; q3; q4; q5; q6]','real');
% -------------------------------规定初始输入参数完---------------------------


% 计算每个关节对应的齐次变换矩阵
T(1:4,1:4,1)=L(1).A(q(1));
for i=2:6
    T(:,:,i)=T(:,:,i-1)*L(i).A(q(i));
end
% 根据齐次变换矩阵得到每个关节的空间三维坐标
for i=1:6
    p(1:3,i)=T(1:3,4,i);
end
% 根据每个连杆的端点坐标，得到连杆质心坐标
for i=1:6
   pc(1:3,i)=p(1:3,i)+rc(1:3,i);
end
% 将质心坐标由机器人坐标系转换为支撑多边形坐标系
for i=1:6
   pc(1:3,i)=pc(1:3,i)+[pb(1);pb(2);0];
end
% 计算总重及质心位置
Mtotal=m(1)+m(2)+m(3)+m(4)+m(5)+m(6)+M;
C=(m(1)*pc(1:3,1)+m(2)*pc(1:3,2)+m(3)*pc(1:3,3)+m(4)*pc(1:3,4)+m(5)*pc(1:3,5)+m(6)*pc(1:3,6))/(Mtotal-M);
COG=(C*(Mtotal-M)+M*pm)/Mtotal;
display(COG);


